#ifndef TASK2_H           // Умовна компіляція: якщо TASK2_H ще не визначений
#define TASK2_H           // Визначаємо TASK2_H, щоб уникнути повторного включення

// Структура Triangle представляє трикутник у 2D-просторі за координатами трьох вершин
struct Triangle {
    double x1, y1;         // Координати першої вершини
    double x2, y2;         // Координати другої вершини
    double x3, y3;         // Координати третьої вершини
    double a, b, c;        // Довжини сторін трикутника
    double perimeter;      // Периметр трикутника
    double area;           // Площа трикутника

    void compute();        // Метод для обчислення сторін, периметру та площі трикутника
    void print();          // Метод для виводу результатів (периметра і площі)
};

#endif // TASK2_H                   // Завершення умовної компіляції
