#ifndef TASK1_H          // Унікальна перевірка, щоб уникнути повторного включення файлу
#define TASK1_H          // Визначення макросу TASK1_H

// Структура для представлення часу (години, хвилини, секунди)
struct TTime {
    int hour;              // Поле для зберігання годин
    int min;               // Поле для зберігання хвилин
    int sec;               // Поле для зберігання секунд

    int CheckTime();       // Метод для перевірки коректності часу (повертає код помилки)
    void NextMin();        // Метод для додавання 1 хвилини до часу
    void Print();          // Метод для виводу часу у форматі ГГ:ХХ:СС
};

#endif // TASK1_H         // Кінець умовної компіляції
